//********************************************************* 
/* 文件名：TEST_64F0Ax_IIC.c
* 功能：   FT64F0Ax_IIC功能演示
* IC:      FT64F0A5 TSSOP20
* 内部：   16M/2T
* 说明：   此演示程序为64F0Ax_IIC的演示程序.
*		   该程序把0x55写入(24C02)0x12地址,后读0x12地址的值，判断是否写入成功  
* 
*
*                FT64F0A5  TSSOP20
*              -------------------
* NC----------|1(PA5)   	(PA4)20|-----------NC     
* NC----------|2(PA6)   	(PA3)19|-----------NC 
* NC----------|3(PA7)   	(PA2)18|-----------NC
* NC----------|4(PC0)   	(PA1)17|-----------NC
* NC----------|5(PC1)		(PA0)16|-----------NC	
* NC----------|6(PB7)		(PB0)15|-----------NC
* GND---------|7(GND)		(PB1)14|-----------NC
* NC----------|8(PB6)		(PB2)13|-----------NC
* VDD---------|9(VDD)		(PB3)12|------IIC_SCL
* NC----------|10(PB5)		(PB4)11|------IIC_SDA
*				-------------------
*/ 
//*********************************************************
#include	"SYSCFG.h";
#include 	"FT64F0AX.h";
//***********************宏定义****************************
#define		uchar	unsigned char

volatile	uchar	IICReadData;
/*-------------------------------------------------
 * 函数名：POWER_INITIAL
 * 功能：  上电系统初始化
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/
 void POWER_INITIAL(void)
 {
	OSCCON=0B01110001;			//系统时钟选择为内部振荡器16MHz,分频比为1:1
    
	INTCON=0;					//禁止所有中断
    
    PORTA=0B00000000;
    PORTB=0B00000000;
    PORTC=0B00000000;
    
	WPUA=0B00000000;			//弱上拉的开关，0-关，1-开		
	WPUB=0B00000000;
	WPUC=0B00000000;	

	WPDA=0B00000000;			//弱下拉的开关，0-关，1-开
	WPDB=0B00000000;
	WPDC=0B00000000;
	
	TRISA=0B00000000;			//输入输出设置，0-输出，1-输入
	TRISB=0B00000000;			//PB4:IIC-SDA PB3:IIC-SCL
	TRISC=0B00000000;

	PSRC0=0B11111111;			//源电流设置最大
	PSRC1=0B11111111;
	PSRC2=0B00001111;

	PSINK0=0B11111111;			//灌电流设置最大
	PSINK1=0B11111111;
	PSINK2=0B00000011;

	ANSELA=0B00000000;			//设置对应的IO为数字IO	
 }
 /*-------------------------------------------------
 * 函数名：SPI_INITIAL
 * 功能：  初始化IIC
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/
 void IIC_INITIAL(void)
 {
     PCKEN|=0B01000000;			//使能I2C模块时钟
     ODCON0|=0B00000010;		//I2C_SCL,I2C_SDA的开漏输出设置，高有效
     
     I2CCR1=0B00000001;			//主机模式，标准模式（100KHz），7位地址格式
     I2CCR2=0B00000000;				
     I2CCR3=0B00000000;			//禁用I2C模块，才能写目标从机地址，设置外设时钟频率以及SCL时钟周期
     I2COARL=0B01010000;		//从机地址
     I2COARH=0B00000000;			
     I2CFREQ=0B00010000;		//外设时钟频率为16MHz
     I2CCCRL=0B00000000;		//标准模式下，SCL时钟周期为2*CCR*Fmaster（Fmaster为外设时钟频率，此处为2*128*16M）
     I2CCCRH=0B00000000;			
     I2CITR=0B00000000;			//禁用所有中断		
     ENABLE=1;					//启用I2C
 }
 /*-------------------------------------------------
 * 函数名：DelayUs
 * 功能：  短延时函数
 * 输入：  Time延时时间长度 延时时长Time Us
 * 输出：  无
 --------------------------------------------------*/
 void DelayUs(uchar Time)
 {
     uchar a;
     for(a=0;a<Time;a++)
     {
         NOP();
	 } 
}
/*-------------------------------------------------
 * 函数名：DelayMs
 * 功能：  短延时函数
 * 输入：  Time延时时间长度 延时时长Time ms
 * 输出：  无
 --------------------------------------------------*/
 void DelayMs(uchar Time)
 {
     uchar a,b;
     for(a=0;a<Time;a++)
     {
         for(b=0;b<5;b++)
         {
             DelayUs(197);
         }
     }
 }
/*-------------------------------------------------
 * 函数名：DelayS
 * 功能：  短延时函数
 * 输入：  Time延时时间长度 延时时长Time S
 * 输出：  无
 --------------------------------------------------*/
 void DelayS(uchar Time)
 {
     uchar a,b;
     for(a=0;a<Time;a++)
     {
         for(b=0;b<10;b++)
         {
             DelayMs(100);
         }
     }
 }
/*-------------------------------------------------
 * 函数名：IIC_Read
 * 功能：  IIC读出特定位置的数据
 * 输入：  address
 * 输出：  读出address存储器里面的数据iicdata
 --------------------------------------------------*/
 uchar IIC_Read(uchar address)
 {
     uchar iicdata=0;
     while(!IICTXE);		
     I2CDR=address;
     I2CCMD=0B00000110;
     while(!IICTXE);
     I2CCMD=0B00000011;
     while(!IICRXNE);
     iicdata=I2CDR;
     return iicdata;
 }
/*-------------------------------------------------
 * 函数名：IIC_Write
 * 功能：  IIC把数据data写入特定的位置address
 * 输入：  address，data
 * 输出：  无
 --------------------------------------------------*/
void IIC_Write(uchar address , uchar data)
 {
    while(!IICTXE);
	I2CDR = address;
    I2CCMD= 0B00000000;
    while(!IICTXE);
    I2CDR = data;
    I2CCMD= 0B00000010;
    while(!IICTXE);
 }
/*-------------------------------------------------
 * 函数名：main
 * 功能：  主函数 
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/
void main(void)
{
    POWER_INITIAL();			//系统初始化
    IIC_INITIAL();				//IIC初始化
    
	IIC_Write(0x12,0x55);		//0X55X写入地址0X12
    DelayMs(10);
	IICReadData=IIC_Read(0x12);	//读取0x12地址EEPROM值
    
    while(1)
    {
        NOP();
    }
}