//********************************************************* 
/* 文件名：TEST_64F0Ax_WDT.c
*  功能：   FT64F0Ax_WDT功能演示
*  IC:   	 FT64F0Ax     TSSOP20
*  内部：   16M	                              
*  说明： 	 程序中开启看门狗并将看门狗时间设置为32ms
*		     a. 主函数先在DemoPortOut脚输出一个高3ms低3ms的信号，
*		     b. 然后循环输出高1ms低1ms，500HZ的信号。
*		  	     如果不在主程序和延时程序中清看门狗，则每隔32ms单片机复位后，会重复输出a+b信号；
*		         如果在主函数中清看门狗，则一直输出b信号
* 
*
*                FT64F0AX  TSSOP20
*              -------------------
* NC----------|1(PA5)   	(PA4)20|-----------NC     
* NC----------|2(PA6)   	(PA3)19|-----------NC 
* NC----------|3(PA7)   	(PA2)18|-----------NC
* NC----------|4(PC0)   	(PA1)17|-----------NC
* NC----------|5(PC1)		(PA0)16|-----------NC	
* NC----------|6(PB7)		(PB0)15|-----------NC
* GND---------|7(GND)		(PB1)14|-----------NC
* NC----------|8(PB6)		(PB2)13|-----------NC
* VDD---------|9(VDD)		(PB3)12|--DemoPortOut
* NC----------|10(PB5)		(PB4)11|-----------NC
*				-------------------
*/ 
//*********************************************************
#include	"SYSCFG.h";
#include 	"FT64F0AX.h";
//*********************************************************
//***********************宏定义*****************************
#define		uchar		unsigned char
#define		uint		unsigned int
#define		ulong		unsigned long

#define		DemoPortOut	PB3
/*-------------------------------------------------
 *	函数名：POWER_INITIAL
 *	功能： 	 上电系统初始化
 *	输入：	 无
 *	输出： 	 无
 --------------------------------------------------*/
 void POWER_INITIAL(void)
 {
	OSCCON=0B01110001;		//系统时钟选择为内部振荡器16MHz,分频比为1:1
    
	INTCON=0;					//禁止所有中断
    
    PORTA=0B00000000;
    PORTB=0B00000000;
    PORTC=0B00000000;
    
	WPUA=0B00000000;			//弱上拉的开关，0-关，1-开		
	WPUB=0B00000000;
	WPUC=0B00000000;	

	WPDA=0B00000000;			//弱下拉的开关，0-关，1-开
	WPDB=0B00000000;
	WPDC=0B00000000;
	
	TRISA=0B11111111;			//输入输出设置，0-输出，1-输入
	TRISB=0B11110111;			//PB3-OUT	
	TRISC=0B00000011;

	PSRC0=0B11111111;			//源电流设置最大
	PSRC1=0B11111111;
	PSRC2=0B00001111;

	PSINK0=0B11111111;			//灌电流设置最大
	PSINK1=0B11111111;
	PSINK2=0B00000011;

	ANSELA=0B00000000;			//设置对应的IO为数字IO	
 }
 /*-------------------------------------------------
 *	函数名：	DelayUs
 *	功能： 	 	短延时函数
 *	输入参数：Time延时时间长度 延时时长Time Us
 *	返回参数： 无
 --------------------------------------------------*/
 void DelayUs(uchar Time)
 {
     uchar a;
     for(a=0;a<Time;a++)
     {
         NOP();
	 } 
}
 /*-------------------------------------------------
 *	函数名：	DelayMs
 *	功能： 	 	短延时函数
 *	输入参数：Time延时时间长度 延时时长Time ms
 *	返回参数： 无
 --------------------------------------------------*/
 void DelayMs(uchar Time)
 {
     uchar a,b;
     for(a=0;a<Time;a++)
     {
         for(b=0;b<5;b++)
         {
             DelayUs(197);
         }
     }
 }
 /*-------------------------------------------------
 *	函数名：	DelayS
 *	功能： 	 	短延时函数
 *	输入参数：Time延时时间长度 延时时长Time S
 *	返回参数： 无
 --------------------------------------------------*/
 void DelayS(uchar Time)
 {
     uchar a,b;
     for(a=0;a<Time;a++)
     {
         for(b=0;b<10;b++)
         {
             DelayMs(100);
         }
     }
 }
 /*-------------------------------------------------
 *	函数名：WDT_INITIAL
 *	功能：	 初始化看门狗，设置复位时间32ms
 *	输入：	 无
 *	输出： 	 无
 --------------------------------------------------*/
 void WDT_INITIAL(void)
 {
     CLRWDT();
     MISC0=0B00000000;			//看门狗时钟32kHz
     WDTCON=0B00001011;			//打开看门狗，预分频1：1，定时器周期1：1024，即看门狗周期为32ms
 }
/*-------------------------------------------------
 *	函数名：main
 *	功能：	 主函数 
 *	输入：	 无
 *	输出： 	 无
 --------------------------------------------------*/
void main(void)
{
    POWER_INITIAL();			//系统初始化
    WDT_INITIAL();				//看门狗初始化
    
    DemoPortOut=1;
    DelayMs(3);
    DemoPortOut=0;
    DelayMs(3);
    
    while(1)
    {
        //CLRWDT();
        DemoPortOut=1;
		DelayMs(1);
		DemoPortOut=0;
		DelayMs(1);
    }
}