//********************************************************* 
/* 文件名：TEST_64F0Ax_MSCK..c
* 功能：   FT64F0Ax_MSCK功能演示
* IC:      FT64F0A5 TSSOP20
* 内部：   16M/2T
* 说明：   测量慢时钟
*
*                FT64F0A5  TSSOP20
*              -------------------
* NC----------|1(PA5)   	(PA4)20|-----------NC     
* NC----------|2(PA6)   	(PA3)19|-----------NC 
* NC----------|3(PA7)   	(PA2)18|-----------NC
* NC----------|4(PC0)   	(PA1)17|-----------NC
* NC----------|5(PC1)		(PA0)16|-----------NC	
* NC----------|6(PB7)		(PB0)15|-----------NC
* GND---------|7(GND)		(PB1)14|-----------NC
* NC----------|8(PB6)		(PB2)13|-----------NC
* VDD---------|9(VDD)		(PB3)12|--DemoPortOut
* NC----------|10(PB5)		(PB4)11|-----------NC
*				-------------------
*/ 
//*********************************************************
#include	"SYSCFG.h";
#include 	"FT64F0AX.h";
//***********************宏定义****************************
#define		uchar		unsigned char
#define		uint		unsigned int

#define		DemoPortOut	PB3

volatile 	uint 		TestBuff;
/*-------------------------------------------------
 * 函数名：POWER_INITIAL
 * 功能：  上电系统初始化
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/
 void POWER_INITIAL(void)
 {
	OSCCON=0B01110001;			//系统时钟选择为内部振荡器16MHz,分频比为1:1
	INTCON=0;					//禁止所有中断
    
    PORTA=0B00000000;
    PORTB=0B00000000;
    PORTC=0B00000000;
    
	WPUA=0B00000000;			//弱上拉的开关，0-关，1-开		
	WPUB=0B00000000;
	WPUC=0B00000000;	

	WPDA=0B00000000;			//弱下拉的开关，0-关，1-开
	WPDB=0B00000000;
	WPDC=0B00000000;
	
	TRISA=0B00000000;			
	TRISB=0B00000000;			//输入输出设置，0-输出，1-输入 PB3-输出
	TRISC=0B00000000;

	PSRC0=0B11111111;			//源电流设置最大
	PSRC1=0B11111111;
	PSRC2=0B00001111;

	PSINK0=0B11111111;			//灌电流设置最大
	PSINK1=0B11111111;
	PSINK2=0B00000011;

	ANSELA=0B00000000;			//设置对应的IO为数字IO	
 }
/*-------------------------------------------------
 * 函数名：DelayUs
 * 功能：  短延时函数
 * 输入：  Time延时时间长度 延时时长Time Us
 * 输出：  无
 --------------------------------------------------*/
 void DelayUs(uchar Time)
 {
     uchar a;
     for(a=0;a<Time;a++)
     {
         NOP();
	 } 
}
 /*-------------------------------------------------
 * 函数名：DelayMs
 * 功能：  短延时函数
 * 输入：  Time延时时间长度 延时时长Time ms
 * 输出：  无
 --------------------------------------------------*/
 void DelayMs(uchar Time)
 {
     uchar a,b;
     for(a=0;a<Time;a++)
     {
         for(b=0;b<5;b++)
         {
             DelayUs(197);
         }
     }
 }
/*-------------------------------------------------
 * 函数名：SlowTimeTest
 * 功能：  快时钟测量慢时钟
 * 输入：  无
 * 输出：  慢时钟时钟测量值TestTime
		   不开平均模式慢时钟频率=16M/TestTime(2T)
           开平均模式慢时钟频率=16M/TestTime/4(2T)
 --------------------------------------------------*/
uint SlowTimeTest(void)
 {
     PCKEN|=0B00000100;				//使能TIM2模块时钟	
     TCKSRC=0B00010000;				//TIM2时钟源HIRC
     T2CEN=1;						//使能Timer2计数器
     CKMAVG=1;						//打开平均模式
     CKCNTI=1;						//使能快时钟测量慢时钟周期
     NOP();
     while(!CKMIF);					//等待慢时钟测量完成
     CKMIF=0;						//软件清0标志位
     return (uint)(SOSCPRH<<8|SOSCPRL);
 }
/*-------------------------------------------------
 * 函数名：main
 * 功能：  主函数 
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/
void main(void)
{
    POWER_INITIAL();				//系统初始化
    
    while(1)
    {
        TestBuff=SlowTimeTest();	//时钟测量值
       
		NOP();
        NOP();
        NOP();
        DelayMs(200);							
    }
}