//********************************************************* 
/* IC:      FT64F0A5 TSSOP20
* 内部：   16M/2T
*
*                FT64F0A5  TSSOP20
*              -------------------
* NC----------|1(PA5)   	(PA4)20|---------HTV+     
* NTISNS------|2(PA6)   	(PA3)19|---------HTV- 
* NC----------|3(PA7)   	(PA2)18|-----CLK/U1RX
* MCLRB-------|4(PC0)   	(PA1)17|---------LED1
* LED5--------|5(PC1)		(PA0)16|-------HTCRTL	
* LED6--------|6(PB7)		(PB0)15|---------VABR
* GND---------|7(GND)		(PB1)14|---------TBAT
* DAT/U1TX----|8(PB6)		(PB2)13|---------LED2
* VDD---------|9(VDD)		(PB3)12|---------LED3
* CHRG--------|10(PB5)		(PB4)11|----------BTN
*				-------------------
*/ 
//*********************************************************
#include	"SYSCFG.h";
#include 	"FT64F0AX.h";
//***********************宏定义****************************
#define	uchar	unsigned char
#define	uint	unsigned int
#define	ulong	unsigned long

#define	LED1	PA1
#define	LED2	PB2
#define	LED3	PB3
#define	LED5	PC1
#define	LED6	PB7
#define	BTN 	PB4
/*-------------------------------------------------
 * 函数名：POWER_INITIAL
 * 功能：  上电系统初始化
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/
 void POWER_INITIAL(void)
 {
	OSCCON=0B01110001;			//系统时钟选择为内部振荡器16MHz,分频比为1:1
	INTCON=0;					//禁止所有中断
    
    PORTA=0B00000000;
    PORTB=0B00000000;
    PORTC=0B00000000;

	TRISA=0B11111101;			//输入输出设置，0-输出，1-输入
	TRISB=0B01110011;
	TRISC=0B00000001;
        
	WPUA=0B00000000;			//弱上拉的开关，0-关，1-开		
	WPUB=0B00010000;
	WPUC=0B00000000;			

	WPDA=0B00000000;			//弱下拉的开关，0-关，1-开
	WPDB=0B00000000;
	WPDC=0B00000000;

	PSRC0=0B11111111;			//源电流设置最大
	PSRC1=0B11111111;
	PSRC2=0B00001111;

	PSINK0=0B11111111;			//灌电流设置最大
	PSINK1=0B11111111;
	PSINK2=0B00000011;

	ANSELA=0B00000000;			//设置对应的IO为数字IO	
 }
/*-------------------------------------------------
 * 函数名：DelayUs
 * 功能：  短延时函数
 * 输入：  Time延时时间长度 延时时长Time Us
 * 输出：  无
 --------------------------------------------------*/
 void DelayUs(uchar Time)
 {
     uchar a;
     for(a=0;a<Time;a++)
     {
         NOP();
	 } 
}
/*-------------------------------------------------
 * 函数名：DelayMs
 * 功能：  短延时函数
 * 输入：  Time延时时间长度 延时时长Time ms
 * 输出：  无
 --------------------------------------------------*/
 void DelayMs(uchar Time)
 {
     uchar a,b;
     for(a=0;a<Time;a++)
     {
         for(b=0;b<5;b++)
         {
             DelayUs(197);
         }
     }
 }
/*-------------------------------------------------
 * 函数名：main
 * 功能：  主函数 
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/
void main(void)
{
    POWER_INITIAL();			//系统初始化
    while(1)
    {
        if(BTN == 1){
            LED1=0;
            LED2=0;
            LED3=0;
            LED5=0;
            LED6=0;
            DelayMs(100);
        } else if(BTN == 0){
            LED1=1;
            LED2=1;
            LED3=1;
            LED5=1;
            LED6=1;
            DelayMs(100);
        }       
    }
}