//********************************************************* 
/* 文件名：TEST_64F0Ax_IO_INTERRUPT.c
* 功能：   FT64F0Ax_IO_INTERRUPT功能演示
* IC:      FT64F0A5 TSSOP20
* 内部：   16M/2T
* 说明：   外部PA3引脚电平变化中断使RB3输出0.75us脉冲
*
*                FT64F0A5  TSSOP20
*              -------------------
* NC----------|1(PA5)   	(PA4)20|-----------NC     
* NC----------|2(PA6)   	(PA3)19|---DemoPortIn 
* NC----------|3(PA7)   	(PA2)18|-----------NC
* NC----------|4(PC0)   	(PA1)17|-----------NC
* NC----------|5(PC1)		(PA0)16|-----------NC	
* NC----------|6(PB7)		(PB0)15|-----------NC
* GND---------|7(GND)		(PB1)14|-----------NC
* NC----------|8(PB6)		(PB2)13|-----------NC
* VDD---------|9(VDD)		(PB3)12|--DemoPortOut
* NC----------|10(PB5)		(PB4)11|-----------NC
*				-------------------
*/ 
//*********************************************************
#include	"SYSCFG.h";
#include 	"FT64F0AX.h";
//***********************宏定义****************************
#define	uchar	unsigned char

#define	DemoPortOut	PB3
#define	DemoPortIn	PA3
/*-------------------------------------------------
 * 函数名：interrupt ISR
 * 功能：  输出0.75us脉冲
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/
void interrupt ISR(void)
{
	if(EPIF0&0X08)					
    {
        EPIF0=0X08;			//写1清零标志位
        DemoPortOut=1;
        NOP();
        NOP();
        NOP();
        NOP();
        NOP();
        DemoPortOut=0;
    }
}
/*-------------------------------------------------
 * 函数名：POWER_INITIAL
 * 功能：  上电系统初始化
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/
 void POWER_INITIAL(void)
 {
	OSCCON=0B01110001;			//系统时钟选择为内部振荡器16MHz, 分频比为1:1
	INTCON=0;					//禁止所有中断
    
    PORTA=0B00000000;
    PORTB=0B00000000;
    PORTC=0B00000000;
    
	WPUA=0B00000000;			//弱上拉的开关，0-关，1-开		
	WPUB=0B00000000;
	WPUC=0B00000000;	

	WPDA=0B00000000;			//弱下拉的开关，0-关，1-开
	WPDB=0B00000000;
	WPDC=0B00000000;
	
	TRISA=0B00000000;			//PA输入输出，0-输出，1-输入 PA3-输入
	TRISB=0B00000000;			//PB输入输出，0-输出，1-输入 PB3-输出
	TRISC=0B00000000;

	PSRC0=0B11111111;			//源电流设置最大
	PSRC1=0B11111111;
	PSRC2=0B00001111;

	PSINK0=0B11111111;			//灌电流设置最大
	PSINK1=0B11111111;
	PSINK2=0B00000011;

	ANSELA=0B00000000;			//设置对应的IO为数字IO	
 }
 /*-------------------------------------------------
 * 函数名：IO_INT_INITIAL
 * 功能：  IO中断初始化 
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/
 void IO_INT_INITIAL(void)
 {
     EPS0=0B00000000;			//选择PA3管脚中断
     EPS1=0B00000000;
     ITYPE0=0B11000000;			//双边沿中断
     ITYPE1=0B00000000;
     EPIE0=0B00001000;			//使能中断3
     INTCON=0B11000000;	    	//使能总中断和外设中断
 }
/*-------------------------------------------------
 * 函数名：main
 * 功能：  主函数 
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/
void main(void)
{
    POWER_INITIAL();			//系统初始化
    IO_INT_INITIAL();
    
    while(1)
    {
        NOP();
    }
}